import pandas as pd

Variables

In [2]:
a=100
b=50
ab = 'Are you kidding me?'

In [3]:
print (a+b, ab)

150 Are you kidding me?

In [4]:
a=b=5
a+b+a+b

20

Operators

In [5]:
100*5//(20+6-16)/10%2

1.0

In [6]:
A=B=3
A==B

True

In [7]:
A>4

False

In [8]:
int('025',8)

21

In [9]:
int('0xff',16)

255

In [10]:
int('1111',2)

15

In [11]:
int(2.0)

2

In [12]:
int('2')

2

In [13]:
float(31415926)

31415926.0

In [14]:
float(6)

6.0

In [15]:
chr(99)

'c'

In [16]:
chr(90)

'Z'

Simplifying Arithmetic Operations

In [17]:
 round(3.1415926, 5)

3.14159

In [18]:
round(123.456)

123

In [19]:
c=complex('6-2j')
abs(c)

6.324555320336759

In [20]:
isinstance(2.0, float)

True

In [21]:
isinstance(3,int)

True

In [22]:
isinstance(0, (int,float))

True

In [23]:
pow (2,2,2)

0

In [24]:
 list(range(5))

[0, 1, 2, 3, 4]

In [25]:
list(range(5,10))

[5, 6, 7, 8, 9]

In [26]:
list(range(5 ,10, 2))

[5, 7, 9]

Print Statement

In [27]:
print ("Toronto Raptors")

Toronto Raptors

In [28]:
print('wow')

wow

In [29]:
print(""" My name is Tony
I become fat and
I want to lose .""")

 My name is Tony
I become fat and
I want to lose .

In [30]:
a= "i"
b="am"
c="tony"

In [31]:
print (a,b,c)

i am tony

In [32]:
print(a+b+c)

iamtony

In [33]:
print("i %s" % "am %s" % c)

i am tony

In [34]:
print("i %s %s" % (b, c))

i am tony

In [35]:
print("i will show up %s at %d am"% ('here',8))

i will show up here at 8 am

In [36]:
print('$'*10)

$$$$$$$$$$

In [37]:
print("monday\ntuesday\nwednesday\nthursday\nfriday\nsaturday\nsunday")

monday
tuesday
wednesday
thursday
friday
saturday
sunday

In [38]:
print("\\n is good stuff")

\n is good stuff

In [39]:
print("""do not do:
\t - copy
\t - paste
\t - forget
""")

do not do:
	 - copy
	 - paste
	 - forget

Data Structure

In [40]:
A=[]
type (A)

list

In [41]:
A=['basketball','soccor' ,'volleyball']

In [42]:
A[1]

'soccor'

In [43]:
A[-2]

'soccor'

In [44]:
B=['football','hockey','baseball']

In [45]:
C=[A,B]
print(C)

[['basketball', 'soccor', 'volleyball'], ['football', 'hockey', 'baseball']]

In [46]:
 C[1]

['football', 'hockey', 'baseball']

In [47]:
C [0][0]

'basketball'

Slicing

In [48]:
num=[0,1,2,3,4,5,6,7,8,9]

In [49]:
num[0:8]

[0, 1, 2, 3, 4, 5, 6, 7]

In [50]:
num[2:]

[2, 3, 4, 5, 6, 7, 8, 9]

In [51]:
num[:9]

[0, 1, 2, 3, 4, 5, 6, 7, 8]

In [52]:
num[:9:2]

[0, 2, 4, 6, 8]

Bulid in List Funtions

In [53]:
len(num)

10

In [54]:
min(num)

0

In [55]:
max(num)

9

In [56]:
[0,1,2,3,4]+[5,6,7,8,9]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [57]:
names=['Mattew','Kumar','Tony']

In [58]:
'Tony' in names

True

In [59]:
'Kelly' in names

False

In [60]:
LetterList=['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t','u','v','w','x','y','z']

In [61]:
max(LetterList)

'z'

In [62]:
min(LetterList)

'a'

In [63]:
numberList=['1','10','100','1000','999']

In [64]:
min (numberList)

'1'

In [65]:
max(numberList)

'999'

In [66]:
max(names,key=len)

'Mattew'

In [67]:
min(names,key=len)

'Tony'

In [68]:
names=['Mattew','Kumar','Tony','sylvia','Jack']

In [69]:
max(names,key=len)

'Mattew'

In [70]:
min(names,key=len)

'Tony'

In [71]:
list('Toronto')

['T', 'o', 'r', 'o', 'n', 't', 'o']

In [72]:
rbc=[1,1,1,2,2,2,3,3,3]

In [73]:
rbc.append(9)

In [74]:
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9]

In [75]:
rbc.count(2)

3

In [76]:
cibc=[9]

In [77]:
rbc.append(cibc)

In [78]:
print(rbc)

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9, [9]]

In [79]:
rbc.extend(cibc)

In [80]:
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9, [9], 9]

In [81]:
national=[1,2,3,4,5,6,7]

In [82]:
national.index(3)

2

In [83]:
rbc.insert(11,'joker')

In [84]:
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9, [9], 'joker', 9]

In [85]:
rbc[11]='killing'

In [86]:
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9, [9], 'killing', 9]

In [87]:
rbc[11]=20

In [88]:
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9, [9], 20, 9]

In [89]:
rbc.pop(10)

[9]

In [90]:
rbc.remove(9)

In [91]:
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 20, 9]

In [92]:
del rbc[9]

In [93]:
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9]

In [94]:
rbc.reverse()
rbc

[9, 3, 3, 3, 2, 2, 2, 1, 1, 1]

In [95]:
rbc.sort()
rbc

[1, 1, 1, 2, 2, 2, 3, 3, 3, 9]

In [96]:
rbc.sort(reverse=True)
rbc

[9, 3, 3, 3, 2, 2, 2, 1, 1, 1]

In [97]:
names.sort()
names

['Jack', 'Kumar', 'Mattew', 'Tony', 'sylvia']

In [98]:
names.sort(key=len)
names

['Jack', 'Tony', 'Kumar', 'Mattew', 'sylvia']

Copying a list

In [99]:
copy1=[5,4,3,2,1,0]
copy2=copy1
copy2

[5, 4, 3, 2, 1, 0]

In [100]:
copy1.pop()

0

In [101]:
copy1

[5, 4, 3, 2, 1]

In [102]:
copy1.pop(4)
copy1

[5, 4, 3, 2]

In [103]:
copy1.append(1)

In [104]:
copy1

[5, 4, 3, 2, 1]

In [105]:
copy2

[5, 4, 3, 2, 1]

In [106]:
copy1=[5,4,3,2,1,0]
copy2=copy1[3:]

In [107]:
copy2

[2, 1, 0]

Tuples

In [108]:
a=divmod(9,4)
a

(2, 1)

In [109]:
type(a)

tuple

In [110]:
30,

(30,)

In [111]:
3*(30,)

(30, 30, 30)

In [112]:
tup1=tuple([2,3,4,5])
tup1

(2, 3, 4, 5)

In [113]:
tup2=tuple(['Toronto'])
tup2

('Toronto',)

Mapping one tuple to another

In [114]:
(A,B,C)=('apple','pear','banana')
A,B,C

('apple', 'pear', 'banana')

Build in Tuple Function

In [115]:
d=tuple('Tony')
d

('T', 'o', 'n', 'y')

In [116]:
d.count('o')

1

Sets

In [117]:
NonRep=set()
type(NonRep)

set

In [118]:
NonRep=set([1,1,1,2,2,3,3,4])
NonRep

{1, 2, 3, 4}

Build-inFunctions

In [119]:
set1=set([1,3,5,7,9])
set2=set([2,3,4,5,6,8,0])
set1.union(set2)

{0, 1, 2, 3, 4, 5, 6, 7, 8, 9}

In [120]:
set1.add(10)

In [121]:
set1

{1, 3, 5, 7, 9, 10}

In [122]:
set1.intersection(set2)

{3, 5}

In [123]:
set1.difference(set2)

{1, 7, 9, 10}

In [124]:
set2.difference(set1)

{0, 2, 4, 6, 8}

In [125]:
set2.symmetric_difference(set1)

{0, 1, 2, 4, 6, 7, 8, 9, 10}

In [126]:
set1.issubset(set2)

False

In [127]:
set2.issubset(set1)

False

In [128]:
set2.issuperset(set1)

False

In [129]:
set1

{1, 3, 5, 7, 9, 10}

In [130]:
set1.pop()

1

In [131]:
set1

{3, 5, 7, 9, 10}

In [132]:
set1.pop()
set1

{5, 7, 9, 10}

In [133]:
set1.pop()

5

In [134]:
set1

{7, 9, 10}

In [135]:
set1.pop()
set1

{9, 10}

In [136]:
set1.remove(10)

In [137]:
set1

{9}

In [138]:
set1.add(5)
set1

{5, 9}

In [139]:
set1.clear()
set1

set()

Control Flow Statement

In [140]:
mName='Tony'
if mName=='Tony':
    print ("Hi, Tony")

Hi, Tony

In [141]:
Scores=100
if Scores>=100:
    print("YOU WIN!")
else:
    print("GAME OVER")

YOU WIN!

In [142]:
A='JACK' 
ageJack=18 
if A=='MIKE':
    print("go to basement")
elif A=="JACK":
     print("go to backyard")
     if ageJack==18:
        print("Grab a beer")
     else:
        print("Drink pop instead")
else:
    print("go to kitchen")

go to backyard
Grab a beer

Loops

In [143]:
for a in range(9):
    print (a)

0
1
2
3
4
5
6
7
8

In [144]:
bank_of_banks=[['rbc','cibc'],['bmo','scotia'],['national','td']]
for bank1 in bank_of_banks:
    print(bank1)

['rbc', 'cibc']
['bmo', 'scotia']
['national', 'td']

In [145]:
bank_of_banks=[['rbc','cibc'],['bmo','scotia'],['national','td']]
for bank1 in bank_of_banks:
    for superman in bank1:
        print(superman)

rbc
cibc
bmo
scotia
national
td

In [146]:
x=1
while x<5:
    print('try again')
    x=x+1
print('game over')

try again
try again
try again
try again
game over

In [147]:
for x in range(99):
    print ('x')
    if x>=10:
        break

x
x
x
x
x
x
x
x
x
x
x

In [148]:
    data=[]
    for i in range (0,10):
        x=8*i
        data.append(x)
    print(data)

[0, 8, 16, 24, 32, 40, 48, 56, 64, 72]

In [149]:
[8*i for i in range(0,10)]

[0, 8, 16, 24, 32, 40, 48, 56, 64, 72]

Intro to Pandas

In [150]:
import pandas as pd
import datetime

In [151]:
fDay=datetime.datetime(2017,11,13)
lDay=datetime.datetime(2017,11,20)
step=datetime.timedelta(days=1)
dates=[]

In [152]:
while fDay<lDay:
    dates.append(fDay.strftime('%m-%d'))
    fDay+=step

In [153]:
dates

['11-13', '11-14', '11-15', '11-16', '11-17', '11-18', '11-19']

In [154]:
t1={'Date': dates, 'Toronto': [6,6,6,6,2,10,3], 'Ottawa': [2,4,7,6,1,4,3], 'Montreal': [1,4,5,6,-1,4,3], }

In [155]:
t1

{'Date': ['11-13', '11-14', '11-15', '11-16', '11-17', '11-18', '11-19'],
 'Montreal': [1, 4, 5, 6, -1, 4, 3],
 'Ottawa': [2, 4, 7, 6, 1, 4, 3],
 'Toronto': [6, 6, 6, 6, 2, 10, 3]}

In [156]:
temps=pd.DataFrame(t1)

In [157]:
cityTemps= temps['Toronto']

In [158]:
cityTemps

0     6
1     6
2     6
3     6
4     2
5    10
6     3
Name: Toronto, dtype: int64

In [159]:
cityTemps=temps.set_index('Date')
cityTemps

       Montreal  Ottawa  Toronto
Date
11-13         1       2        6
11-14         4       4        6
11-15         5       7        6
11-16         6       6        6
11-17        -1       1        2
11-18         4       4       10
11-19         3       3        3

In [160]:
medals=pd.read_csv('C:/Users/YINGNAN/Downloads/YorkU/Data/yorkBigData-master/assignments/data/olympicmedals.csv',encoding='latin1')

In [161]:
medals.tail(10)

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
29206,Beijing,2008,Wrestling,Wrestling Gre-R,"MINGUZZI, Andrea",ITA,Men,74 - 84kg,M,Gold
29207,Beijing,2008,Wrestling,Wrestling Gre-R,"FODOR, Zoltan",HUN,Men,74 - 84kg,M,Silver
29208,Beijing,2008,Wrestling,Wrestling Gre-R,"MAMBETOV, Asset",KAZ,Men,84 - 96kg,M,Bronze
29209,Beijing,2008,Wrestling,Wrestling Gre-R,"WHEELER, Adam",USA,Men,84 - 96kg,M,Bronze
29210,Beijing,2008,Wrestling,Wrestling Gre-R,"KHUSHTOV, Aslanbek",RUS,Men,84 - 96kg,M,Gold
29211,Beijing,2008,Wrestling,Wrestling Gre-R,"ENGLICH, Mirko",GER,Men,84 - 96kg,M,Silver
29212,Beijing,2008,Wrestling,Wrestling Gre-R,"MIZGAITIS, Mindaugas",LTU,Men,96 - 120kg,M,Bronze
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

In [162]:
medals.Gender.value_counts()

Men      21721
Women     7495
Name: Gender, dtype: int64

Getting started with pandas

In [163]:
import pandas as pd

In [164]:
from pandas import Series, DataFrame

In [165]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10,6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows

np.set_printoptions(precision=4,suppress=True)

Introduction to pandas Data Structures

Series

In [166]:
obj=pd.Series([8,1,6,23])
obj

0     8
1     1
2     6
3    23
dtype: int64

In [167]:
obj.values

array([ 8,  1,  6, 23], dtype=int64)

In [168]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [169]:
obj2=pd.Series([8,1,6,23], index=['a','b','c','d'])
obj2

a     8
b     1
c     6
d    23
dtype: int64

In [170]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [171]:
obj2['d']=2017
obj2['c']=11
obj2['b']=13
obj2['a']=0
obj2[['d','c','b']]

d    2017
c      11
b      13
dtype: int64

In [172]:
'b' in obj2

True

In [173]:
obj2[obj2>0]
obj2*2

a       0
b      26
c      22
d    4034
dtype: int64

In [174]:
np.exp(obj2)

C:\Users\YINGNAN\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: overflow encountered in exp
  """Entry point for launching an IPython kernel.

a    1.000000e+00
b    4.424134e+05
c    5.987414e+04
d             inf
dtype: float64

In [175]:
'b' in obj2

True

In [176]:
'e'in obj2

False

In [177]:
obj3=pd.Series({'USA':1, 'CANADA':2, 'RUSSIA':3, 'CHINA':4})
obj3

CANADA    2
CHINA     4
RUSSIA    3
USA       1
dtype: int64

In [178]:
obj3[['USA','CANADA','RUSSIA','CHINA']]

USA       1
CANADA    2
RUSSIA    3
CHINA     4
dtype: int64

In [179]:
nData={'Ontario':1, 'BC':2, 'Qubec':3}
province=['Yukon','BC','Qubec']
obj4=pd.Series(nData,index=province)
obj4

Yukon    NaN
BC       2.0
Qubec    3.0
dtype: float64

In [180]:
obj4.name='Index of Popularity'
obj4.index.name='Province'
obj4

Province
Yukon    NaN
BC       2.0
Qubec    3.0
Name: Index of Popularity, dtype: float64

In [181]:
obj2

a       0
b      13
c      11
d    2017
dtype: int64

In [182]:
obj2.index=['*','N','O','W']
obj2

*       0
N      13
O      11
W    2017
dtype: int64

DataFrame

In [183]:
data={'City':['Toronto','Ottawo','Montreal'], 'Time':[16, 16, 16], 'Temperature':[6,2,3]}
frame=pd.DataFrame(data)

In [184]:
frame

       City  Temperature  Time
0   Toronto            6    16
1    Ottawo            2    16
2  Montreal            3    16

In [185]:
frame.head()

       City  Temperature  Time
0   Toronto            6    16
1    Ottawo            2    16
2  Montreal            3    16

In [186]:
pd.DataFrame(data, columns=['Time', 'City','Temperature'])

   Time      City  Temperature
0    16   Toronto            6
1    16    Ottawo            2
2    16  Montreal            3

In [187]:
pd.DataFrame(data, columns=['Time', 'City','Temperature'], index=['a','b','c'])

   Time      City  Temperature
a    16   Toronto            6
b    16    Ottawo            2
c    16  Montreal            3

In [188]:
frame.columns

Index(['City', 'Temperature', 'Time'], dtype='object')

In [189]:
frame['City']
frame.Temperature

0    6
1    2
2    3
Name: Temperature, dtype: int64

In [190]:
frame.loc[2]

City           Montreal
Temperature           3
Time                 16
Name: 2, dtype: object

In [191]:
frame['Humidy']=[50,45,40]
frame

       City  Temperature  Time  Humidy
0   Toronto            6    16      50
1    Ottawo            2    16      45
2  Montreal            3    16      40

In [192]:
val=pd.Series([18],index=[1])
frame['Time']=val
frame

       City  Temperature  Time  Humidy
0   Toronto            6   NaN      50
1    Ottawo            2  18.0      45
2  Montreal            3   NaN      40

In [193]:
frame['Humidy']=[50,45,40]
frame

       City  Temperature  Time  Humidy
0   Toronto            6   NaN      50
1    Ottawo            2  18.0      45
2  Montreal            3   NaN      40

In [194]:
frame['Index_of_Humidy']=frame.Humidy>=50
frame

       City  Temperature  Time  Humidy  Index_of_Humidy
0   Toronto            6   NaN      50             True
1    Ottawo            2  18.0      45            False
2  Montreal            3   NaN      40            False

In [195]:
del frame['Index_of_Humidy']
frame.columns

Index(['City', 'Temperature', 'Time', 'Humidy'], dtype='object')

In [196]:
frame.T

                   0       1         2
City         Toronto  Ottawo  Montreal
Temperature        6       2         3
Time             NaN      18       NaN
Humidy            50      45        40

In [197]:
frame.index.name='City'; frame.columns.name='Temperature'
frame

Temperature      City  Temperature  Time  Humidy
City
0             Toronto            6   NaN      50
1              Ottawo            2  18.0      45
2            Montreal            3   NaN      40

In [198]:
frame

Temperature      City  Temperature  Time  Humidy
City
0             Toronto            6   NaN      50
1              Ottawo            2  18.0      45
2            Montreal            3   NaN      40

In [199]:
frame.values

array([['Toronto', 6, nan, 50],
       ['Ottawo', 2, 18.0, 45],
       ['Montreal', 3, nan, 40]], dtype=object)

Index Objects

In [200]:
obj=pd.Series(range(4), index=['a','b','c','d'])
index = obj.index
index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [201]:
index[1:]

Index(['b', 'c', 'd'], dtype='object')

In [202]:
labels= pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [203]:
obj2=pd.Series([2,4,6], index=labels)
obj2

0    2
1    4
2    6
dtype: int64

In [204]:
obj2.index is labels

True

Essential Functionality

Reindexing

In [205]:
obj=pd.Series([2,3,4,5,1], index=['b','c','d','e','a'])
obj

b    2
c    3
d    4
e    5
a    1
dtype: int64

In [206]:
obj2=obj.reindex(['a','b','c','d','e'])
obj2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [207]:
obj3=pd.Series(['td','cibc','rbc'], index=[0,2,4])
obj3
obj3.reindex(range(6), method='ffill')

0      td
1      td
2    cibc
3    cibc
4     rbc
5     rbc
dtype: object

In [208]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=['a', 'c', 'd','e'],
                     columns=['bc', 'on', 'ab'])

In [209]:
frame

   bc  on  ab
a   0   1   2
c   3   4   5
d   6   7   8
e   9  10  11

In [210]:
frame2= frame.reindex(['a', 'b', 'c', 'd','e'])
frame2

    bc    on    ab
a  0.0   1.0   2.0
b  NaN   NaN   NaN
c  3.0   4.0   5.0
d  6.0   7.0   8.0
e  9.0  10.0  11.0

In [211]:
provinces=['bc','ab','pei']
frame.reindex(columns=provinces)

   bc  ab  pei
a   0   2  NaN
c   3   5  NaN
d   6   8  NaN
e   9  11  NaN

In [212]:
frame.loc[['a','b','c','d','e'], provinces]

    bc    ab  pei
a  0.0   2.0  NaN
b  NaN   NaN  NaN
c  3.0   5.0  NaN
d  6.0   8.0  NaN
e  9.0  11.0  NaN

Dropping Entries from an Axis

In [213]:
obj=pd.Series(np.arange(4),index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [214]:
new_obj=obj.drop('a')

In [215]:
new_obj

b    1
c    2
d    3
dtype: int32

In [216]:
new_obj.drop(['d'])

b    1
c    2
dtype: int32

In [217]:
frame.drop('bc',axis='columns')

   on  ab
a   1   2
c   4   5
d   7   8
e  10  11

In [218]:
frame.drop('c',inplace=True)

In [219]:
frame

   bc  on  ab
a   0   1   2
d   6   7   8
e   9  10  11

Indexing, Selection, Filtering

In [220]:
obj=pd.Series(np.arange(4),index=['你','我','他','她'])
obj

你    0
我    1
他    2
她    3
dtype: int32

In [221]:
obj['她']

3

In [222]:
obj[1]

1

In [223]:
obj[2:4]

他    2
她    3
dtype: int32

In [224]:
obj[['我','你','她']]

我    1
你    0
她    3
dtype: int32

In [225]:
obj[[1,3]]

我    1
她    3
dtype: int32

In [226]:
obj[obj<2]

你    0
我    1
dtype: int32

In [227]:

obj

你    0
我    1
他    2
她    3
dtype: int32

In [228]:
obj['你':'她']='ok'

In [229]:
obj

你    ok
我    ok
他    ok
她    ok
dtype: object

In [230]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [231]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [232]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [233]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [234]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [235]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [236]:
data[data<7]=0

In [237]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    0      0     7
Utah        8    9     10    11
New York   12   13     14    15

    Selection with loc and iloc

In [238]:
data.loc['Ohio',['one','four']]

one     0
four    0
Name: Ohio, dtype: int32

In [239]:
data.iloc[3,[3,2,1,0]]

four     15
three    14
two      13
one      12
Name: New York, dtype: int32

Integer Indexes

In [240]:
ser=pd.Series(np.arange(4.), index=['a','b','c','d'])
ser

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [241]:
ser[-1]

3.0

In [242]:
ser[-2]

2.0

In [243]:
ser[:1]

a    0.0
dtype: float64

In [244]:
ser.iloc[:1]

a    0.0
dtype: float64

Arithmetic and Data Alignment

In [245]:
s1= pd.Series([1.5,2.5,3.5,4.5], index=['a','b','c','d'])
s2= pd.Series([5.5,6.5,7.6,8.5], index=['a','c','e','f'])
s1

a    1.5
b    2.5
c    3.5
d    4.5
dtype: float64

In [246]:
s2

a    5.5
c    6.5
e    7.6
f    8.5
dtype: float64

In [247]:
s1+s2

a     7.0
b     NaN
c    10.0
d     NaN
e     NaN
f     NaN
dtype: float64

In [250]:
df1 = pd.DataFrame({'A':[3,4]})

In [251]:
df2 = pd.DataFrame({'B':[5,6]})

In [256]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

Arithmetic Methods with fill valuex

In [257]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [259]:
df2.loc[1,'b']=np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [260]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [262]:
df1.add(df2, fill_value=1)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   5.0
1   9.0   6.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0

Operations between DataFrame and Series ???

In [268]:
arr = np.arange(16.).reshape((4,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.],
       [ 12.,  13.,  14.,  15.]])

In [269]:
arr[1]

array([ 4.,  5.,  6.,  7.])

In [270]:
arr - arr[1]

array([[-4., -4., -4., -4.],
       [ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [271]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [272]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [273]:
series=frame.iloc[0]

In [274]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [278]:
frame-series

b    0.0
d   -1.0
e   -2.0
Name: Utah, dtype: float64

In [279]:
series2=pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int32

In [282]:
frame+series2

b    0.0
e    1.0
f    2.0
dtype: float64

Function Application and Mapping

In [286]:
frame = pd.DataFrame(np.random.randn(4, 4), columns=list('bdef'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e         f
Utah    0.302614  0.523772  0.000940  1.343810
Ohio   -0.713544 -0.831154 -2.370232 -1.860761
Texas  -0.860757  0.560145 -1.265934  0.119827
Oregon -1.063512  0.332883 -2.359419 -0.199543

In [287]:
np.abs(frame)

               b         d         e         f
Utah    0.302614  0.523772  0.000940  1.343810
Ohio    0.713544  0.831154  2.370232  1.860761
Texas   0.860757  0.560145  1.265934  0.119827
Oregon  1.063512  0.332883  2.359419  0.199543

In [288]:
f=lambda x: x.max() - x.min()
frame.apply(f)

b    1.366126
d    1.391299
e    2.371172
f    3.204571
dtype: float64

In [289]:
frame.apply(f, axis='columns')

Utah      1.342870
Ohio      1.656688
Texas     1.826080
Oregon    2.692302
dtype: float64

In [290]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e         f
min -1.063512 -0.831154 -2.370232 -1.860761
max  0.302614  0.560145  0.000940  1.343810

In [291]:
frame

               b         d         e         f
Utah    0.302614  0.523772  0.000940  1.343810
Ohio   -0.713544 -0.831154 -2.370232 -1.860761
Texas  -0.860757  0.560145 -1.265934  0.119827
Oregon -1.063512  0.332883 -2.359419 -0.199543

In [293]:
format = lambda x:'%.3f' % x
frame.applymap(format)

             b       d       e       f
Utah     0.303   0.524   0.001   1.344
Ohio    -0.714  -0.831  -2.370  -1.861
Texas   -0.861   0.560  -1.266   0.120
Oregon  -1.064   0.333  -2.359  -0.200

In [294]:
frame['f'].map(format)

Utah       1.344
Ohio      -1.861
Texas      0.120
Oregon    -0.200
Name: f, dtype: object

Sorting and Ranking

In [297]:
obj=pd.Series(range(4),index=['b','c','a','e'])
obj.sort_index()

a    2
b    0
c    1
e    3
dtype: int32

In [298]:
obj

b    0
c    1
a    2
e    3
dtype: int32

In [302]:
obj = pd.Series([0, np.nan, 6, np.nan, -1, 5])

In [303]:
obj

0    0.0
1    NaN
2    6.0
3    NaN
4   -1.0
5    5.0
dtype: float64

In [304]:
obj.sort_values()

4   -1.0
0    0.0
5    5.0
2    6.0
1    NaN
3    NaN
dtype: float64

In [306]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 2, -1]})
frame

   a  b
0  0  4
1  1  7
2  2 -3
3 -1  2

In [307]:
frame.sort_values(by='a')

   a  b
3 -1  2
0  0  4
1  1  7
2  2 -3

In [308]:
frame.sort_values(by=['a','b'])

   a  b
3 -1  2
0  0  4
1  1  7
2  2 -3

In [312]:
obj=pd.Series([2,3])
obj.rank()

0    1.0
1    2.0
dtype: float64

Axis Indexes with Duplicate Labels

In [313]:
obj=pd.Series(range(4),index=['a','a','c','c'])
obj

a    0
a    1
c    2
c    3
dtype: int32

In [314]:
obj.index.is_unique

False

In [315]:
obj['a']

a    0
a    1
dtype: int32

Summarizing and Computing Descriptive Statistics

In [316]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['A', 'B'])
df

      A    B
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [317]:
df.sum()

A    9.25
B   -5.80
dtype: float64

In [318]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [319]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [320]:
df.idxmax()

A    b
B    d
dtype: object

In [321]:
df.describe()

              A         B
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [322]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [323]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [324]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Unique Values, Value Counts, and Membership

In [3]:
import pandas as pd
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [13]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [5]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [7]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [10]:
pd.value_counts(obj.values, sort= False)

a    3
d    1
b    2
c    3
dtype: int64

In [12]:
mask= obj.isin(['b','c'])

In [14]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool